app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
---
  def index
    @pins = Pin.all

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Some Pin"], ["user_id", 1], ["created_at", "2015-04-18 15:48:42.645567"], ["updated_at", "2015-04-18 15:48:42.645567"]]
---
  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save